In [1]:
import pandas as pd
import numpy as np

#### Question 
 Create dataframe from technologies and set index - t1, t2, t3, t4

 technologies = {'Courses':["java", "c++", "Python", "pandas"],

'Fee' :[20000, 25000, 22000, 30000],

'Duration':['30days', '40days', '35days', '50days'],

'Discount':[1000, 2300, 1200, 2000]}

In [37]:
technologies = {'Courses':["java", "c++", "Python", "pandas"],
'Fee' :[20000, 25000, 22000, 30000],
'Duration':['30days', '40days', '35days', '50days'],
'Discount':[1000, 2300, 1200, 2000]}

df =pd.DataFrame(technologies, index=['t1','t2','t3','t4'])
df

   Courses    Fee Duration  Discount
t1    java  20000   30days      1000
t2     c++  25000   40days      2300
t3  Python  22000   35days      1200
t4  pandas  30000   50days      2000

#### Question 1. update the fees of the courses whose duration is more than 35 days to their original fees plus 5000.

In [38]:
df.Duration.dtype

dtype('O')

In [39]:
df.rename(columns={'Duration':'DurationDays'},inplace=True)

In [40]:
df['DurationDays'] = df['DurationDays'].str.replace('days','')
df

   Courses    Fee DurationDays  Discount
t1    java  20000           30      1000
t2     c++  25000           40      2300
t3  Python  22000           35      1200
t4  pandas  30000           50      2000

In [41]:
df['DurationDays'] = df['DurationDays'].astype('int64')
df['DurationDays'].dtype
df

   Courses    Fee  DurationDays  Discount
t1    java  20000            30      1000
t2     c++  25000            40      2300
t3  Python  22000            35      1200
t4  pandas  30000            50      2000

In [42]:
df.loc[(df['DurationDays'] > 35),'Fee'] += 5000
df

   Courses    Fee  DurationDays  Discount
t1    java  20000            30      1000
t2     c++  30000            40      2300
t3  Python  22000            35      1200
t4  pandas  35000            50      2000

#### Question 2:  add a new column `final_fees` that has value fees minus discount

In [44]:
df.loc[:,'Final_fees'] = df.Fee - df.Discount

In [45]:
df

   Courses    Fee  DurationDays  Discount  Final_fees
t1    java  20000            30      1000       19000
t2     c++  30000            40      2300       27700
t3  Python  22000            35      1200       20800
t4  pandas  35000            50      2000       33000

 #### Question 3: rename the column duration to duration_days

In [47]:
df.rename(columns = {'DurationDays':'duration_days'}, inplace = True)
df

   Courses    Fee  duration_days  Discount  Final_fees
t1    java  20000             30      1000       19000
t2     c++  30000             40      2300       27700
t3  Python  22000             35      1200       20800
t4  pandas  35000             50      2000       33000

#### Question 4: Set type of duration column to int by removing days from it's respective values

Already Done